[
  {
    "id": 1,
    "title": "Junglytics",
    "description": "Junglytics es una plataforma de análisis de datos para vendedores de Amazon. Permite visualizar métricas clave y optimizar la rentabilidad de productos FBA.",
    "full_description": "Junglytics es una herramienta web orientada a vendedores de Amazon. La plataforma centraliza y visualiza datos clave de ventas, costos, comisiones, inventario y rentabilidad, permitiendo tomar decisiones basadas en métricas a lo largo del tiempo. Entre sus funcionalidades se incluyen dashboards financieros, reportes detallados de productos y herramientas para optimizar el desempeño de cada ítem en el marketplace. Su objetivo es facilitar la gestión operativa y estratégica del negocio dentro del ecosistema de Amazon",
    "images": [
      { "url": "/images/junglytics/junglytics-1.png", "alt": "Junglytics image 1" },
      { "url": "/images/junglytics/junglytics-2.png", "alt": "Junglytics image 2" },
      { "url": "/images/junglytics/junglytics-3.png", "alt": "Junglytics image 3" }
    ],
    "start_date": "Febrero de 2022",
    "end_date": "Diciembre de 2022",
    "challenges": "Integración de multiples y variados tipos de datos, dashboards interactivos, tablas de datos, gráficos, estadisticas y reportes. Integración con APIs de terceros, autenticación y gestión de usuarios basada en roles.",
    "long_role_explanation": "Me encargué del desarrollo frontend con React, generando una interfaz visual basada en un diseño predefinido via Figma. Implementé la lógica de negocio brindada por los clientes y estuve a cargo de la implementacion de multiples tipos de graficos, tablas e informacion visual clave para el usuario.",
    "technologies": [
      "React",
      "AWS",
      "MaterialUI",
      "Styled Components",
      "Typescript",
      "Recharts"
    ],
    "slug": "junglytics"
  },
  {
    "id": 2,
    "title": "Nicer",
    "description": "Un ecosistema completo para la gestión de viajes. Gestiona itinerarios, pagos, reservas y manten comunicación con los viajeros todo en un mismo sitio.",
    "full_description": "Nicer se define a si misma como el futuro de los viajes, se trata de una plataforma que brinda a los travel advisors multiples herramientas para gestionar viajes de manera eficiente y personalizada, incluyendo un sistema de gestión de itinerarios, pagos, reservas y comunicación con los viajeros. Un ecosistema todo en uno que invluye multiples sitios web como lo son su portal de advisors, landing page, blog de learning, plataforma de booking, itinerario público y hasta su propia aplicacion nativa para los travelers.",
    "images": [
      { "url": "/images/nicer/nicer-2.png", "alt": "Nicer image 2" },
      { "url": "/images/nicer/nicer-1.png", "alt": "Nicer image 1" },
      { "url": "/images/nicer/nicer-3.png", "alt": "Nicer image 3" }
    ],
    "start_date": "Abril de 2024",
    "end_date": "En desarrollo",
    "challenges": "Integración de múltiples APIs de terceros, integracion de un CMS, integración de pagos, gestion de itinerarios complejos y multiples reglas de negocio. Tambien construimos nuestra propia libreria de componentes para el desarrollo frontend.",
    "long_role_explanation": "Estoy a cargo del desarrollo y mantenimiento del frontend de los multiples sitios web y la aplicación nativa, así como de la integración con las APIs de terceros. Actualmente coexisten 5 sitios webs diferentes y una aplicacion mobile en las cuales trabajo junto a un desarrollador frontend / diseñador y un backend developer. </br> </br> Los diferentes sitios web son: </br> </br> - Landing page y pagina de campañas de marketing. </br> - Portal de advisors donde los travel advisors pueden gestionar viajes, itinerarios, pagos, reservaciones y comunicarse con los viajeros a través de un chat propio. </br> - Itinerario público donde los viajeros pueden ver su itinerario rapidamente sin necesidad de loguearse a su cuenta. </br> - Blog de learning, desarrollado con un CMS Headless, este sitio permite hacer training a los travel advisors que se sumen a la plataforma. </br> - Plataforma de booking, donde los viajeros pueden hacer reservas por si mismos sin necesidad de un travel advisor. </br> - Aplicación nativa para los viajeros, donde pueden ver su itinerario, comunicarse con su travel advisor y gestionar su perfil, su información relevante y realizar los pagos correspondientes. </br> </br>",
    "technologies": [
      "React",
      "React Native",
      "Next.js",
      "Sass",
      "AWS",
      "Vite",
      "Styled Components",
      "Contentful",
      "TailwindCSS",
      "Typescript",
      "Stripe"
    ],
    "slug": "nicer"
  },
  {
    "id": "3",
    "title": "1816 | Economía y Estrategia",
    "description": "La consultora 1816 | Economía y Estrategia es una firma argentina especializada en análisis macroeconómico y financiero.",
    "full_description": "1816 se destaca por el uso intensivo de herramientas de Big Data para proveer informes detallados y asesoramiento técnico a inversores institucionales, empresas y entidades del sistema financiero. Su objetivo principal es brindar herramientas basadas en datos para comprender el contexto económico argentino y regional, evaluar riesgos y tomar decisiones informadas.",
    "images": [
      { "url": "/images/1816/1816-1.png", "alt": "1816 image 1" },
      { "url": "/images/1816/1816-2.png", "alt": "1816 image 2" },
      { "url": "/images/1816/1816-3.png", "alt": "1816 image 3" },
      { "url": "/images/1816/1816-4.png", "alt": "1816 image 4" }
    ],
    "start_date": "Mayo de 2023",
    "end_date": "Septiembre de 2023",
    "challenges": "Principalmente tratar de comprender la lógica de negocio y la forma en la que los datos eran utilizados para generar reportes y graficos. Ademas, tomar un proyecto que ya estaba en marcha y adaptarme a la forma de trabajo del equipo en tiempos acotados.",
    "long_role_explanation": "Inicialmente me uní al proyecto para cubrir un periodo vacacional, pero luego debido al buen desempeño y a la rapida adaptacion al equipo continué trabajando como desarrollador frontend por un periodo mas largo. Durante mi tiempo allí, trabajé en la creación de herramientas de análisis y visualización de instrumentos financieros, así como en la implementación e integración de gráficos y dashboards interactivos.",
    "technologies": ["React", "MaterialUI", "Styled Components", "Typescript"],
    "slug": "1816"
  },
  {
    "id": "4",
    "title": "Trac",
    "description": "TRAC es una plataforma todo-en-uno para artistas que combina distribución musical, Web3 y venta de merchandising sin inventario.",
    "full_description": "TRAC es una startup de tecnología musical con sede en Los Ángeles. Su objetivo es empoderar a artistas independientes mediante una plataforma que integra distribución musical, venta de merchandising personalizado y herramientas de monetización basadas en tecnologías Web3. Con TRAC, los artistas pueden lanzar su música en más de 40 plataformas de streaming, gestionar pagos en USD o criptomonedas, y crear tokens únicos para incentivar la participación de sus fans. La plataforma también ofrece páginas personalizadas para cada artista, facilitando la conexión directa con su audiencia y la gestión de su marca personal.",
    "images": [
      { "url": "/images/trac/trac-1.png", "alt": "Trac image 1" },
      { "url": "/images/trac/trac-2.png", "alt": "Trac image 2" },
      { "url": "/images/trac/trac-3.png", "alt": "Trac image 3" },
      { "url": "/images/trac/trac-4.png", "alt": "Trac image 4" },
      { "url": "/images/trac/trac-5.png", "alt": "Trac image 5" }
    ],
    "start_date": "Abril de 2022",
    "end_date": "Abril de 2023",
    "challenges": "Trabajar con un equipo de desarrollo numeroso, con diferentes husos horarios y con un producto en constante evolución. Cuando me uní al equipo, la plataforma ya estaba en desarrollo, por lo que tuve que adaptarme rápidamente a la lógica de negocio y a la forma de trabajo del equipo. Además, el producto estaba en constante evolución, lo que requería una rápida adaptación a los cambios y una buena comunicación con el equipo. Tecnicamente, el desafío fue trabajar con un stack de tecnologías que no conocía, lo que me obligó a aprender y aplicarlo rápidamente.",
    "long_role_explanation": "Me uní al equipo de TRAC como desarrollador frontend, donde trabajé a la par de otras personas en la creación de una plataforma web para artistas. Dentro de las tareas que realicé, se encuentran la integración de dos sitios webs a un backend compartido, ademas de crear una tercera pagina web en formato blog con Sanity (Un CMS Headless).",
    "technologies": [
      "AWS",
      "React",
      "Typescript",
      "Styled Components",
      "Sanity",
      "Ant Design",
      "Next.js"
    ],
    "slug": "trac"
  },
  {
    "id": "5",
    "title": "Reedy",
    "description": "¿Eres estudiante o universitario y necesitas una computadora? Con Reedy podrás elegir la que mejor se adapte a tus necesidades, conservarla todo el tiempo que necesites y devolverla cuando quieras.",
    "full_description": "En lugar de pensar en el hardware como un objeto a comprar, Reedy ofrece a los estudiantes un servicio innovador de alquiler de un ordenador con el rendimiento adecuado a sus necesidades y con garantía de uso durante todo el periodo de estudios. Los estudiantes pueden elegir entre diferentes “perfiles tecnológicos” (ordenadores con distintos niveles de rendimiento y prestaciones).",
    "images": [
      { "url": "/images/reedy/reedy-1.png", "alt": "Reedy image 1" },
      { "url": "/images/reedy/reedy-2.png", "alt": "Reedy image 2" },
      { "url": "/images/reedy/reedy-3.png", "alt": "Reedy image 3" },
      { "url": "/images/reedy/reedy-4.png", "alt": "Reedy image 4" },
      { "url": "/images/reedy/reedy-5.png", "alt": "Reedy image 5" },
      { "url": "/images/reedy/reedy-6.png", "alt": "Reedy image 6" }
    ],
    "start_date": "Junio de 2023",
    "end_date": "Septiembre de 2023",
    "challenges": "Confeccion de un sistema de gestión de usuarios y autenticación, confeccion de un sistema de gestión de inventario, alquileres y pagos",
    "long_role_explanation": "Durante el desarrollo de Reedy, participé de la confección del frontend de 3 sitios web diferentes, una landing page, un sitio web donde los estudiantes se registran y gestionan su alquiler, y un sitio web para los administradores donde gestionan el inventario y los pagos. En el caso de la landing page se utilizó Next JS, mientras que para los otros dos sitios se utilizó React con Vite.",
    "technologies": [
      "AWS",
      "React",
      "Next.js",
      "Vite",
      "Typescript",
      "Styled Components",
      "MaterialUI"
    ],
    "slug": "reedy"
  },
  {
    "id": "6",
    "title": "Sinapsis News",
    "description": "Sinapsis News es el punto de partida para la creación de tu propio portal de noticias. Con un diseño moderno y una interfaz intuitiva, podrás crear un sitio web atractivo y funcional sin preocuparte por el código.",
    "full_description": "Sinapsis News es un web template que permite a los usuarios crear su propio portal de noticias de manera rápida y sencilla, sin preocuparse por la programación. Con un diseño moderno y una interfaz intuitiva ya integrada a un CMS, los usuarios pueden cargar sus noticias a través de Sanity, o aprovechar una herramienta opcional como lo es el migrador de contenido para importar noticias desde tu actual sitio web. La plataforma está diseñada para ser fácil de usar y posee soporte para anuncios a través de Google Ad Manager. Cuenta además con una aplicación móvil nativa para iOS y Android, lo que permite a los usuarios acceder a su contenido desde cualquier lugar y en cualquier momento.",
    "images": [
      {
        "url": "/images/sinapsis-news/sinapsis-news-1.png",
        "alt": "Sinapsis News image 1"
      },
      {
        "url": "/images/sinapsis-news/sinapsis-news-2.png",
        "alt": "Sinapsis News image 2"
      },
      {
        "url": "/images/sinapsis-news/sinapsis-news-3.png",
        "alt": "Sinapsis News image 3"
      },
      {
        "url": "/images/sinapsis-news/sinapsis-news-4.png",
        "alt": "Sinapsis News image 4"
      }
    ],
    "start_date": "Febrero de 2025",
    "end_date": "En desarrollo",
    "challenges": "Creación de un template web integrado con un CMS Headless, manteniento tipados lo mas genérico posible para que el cliente pueda cargar su contenido sin problemas. Integración de publicidad a través de Google Ad Manager y configuración de SEO muy detallada para cada página, dado que en este rubro el SEO es fundamental.",
    "long_role_explanation": "Me encargo del desarrollo y mantenimiento del frontend de la plataforma, así como de la integración con el CMS Headless. Por otro lado también me encargo del desarrollo y mantenimiento de los esquemas, tipados y publicación del sitio utilizado como interfaz de carga del contenido.",
    "technologies": ["React", "Next.js", "Typescript", "Sanity", "MaterialUI"],
    "slug": "sinapsis-news"
  },
  {
    "id": "7",
    "title": "Sinapsis Site",
    "description": "Sinapsis es una empresa de desarrollo de software especializada en la creación de soluciones tecnológicas a medida en la nube. Con un enfoque en la innovación y la calidad, Sinapsis ofrece servicios de desarrollo de software, consultoría y soporte técnico para empresas de diversos sectores.",
    "full_description": "Sinapsis es una empresa con un largo historial en el desarrollo de software a medida. Su enfoque se centra en la creación de soluciones tecnológicas innovadoras y de alta calidad, adaptadas a las necesidades específicas de cada cliente. La empresa ofrece una amplia gama de servicios, incluyendo desarrollo de software web y móvil, consultoría en tecnología y soporte técnico. En este sitio podras encontrar información sobre la empresa, sus servicios e inclusive casos de exitos o información detallada sobre trabajos realizados por la misma.",
    "images": [
      {
        "url": "/images/sinapsis-site/sinapsis-site-1.png",
        "alt": "Sinapsis Site image 1"
      },
      {
        "url": "/images/sinapsis-site/sinapsis-site-2.png",
        "alt": "Sinapsis Site image 2"
      },
      {
        "url": "/images/sinapsis-site/sinapsis-site-3.png",
        "alt": "Sinapsis Site image 3"
      }
    ],
    "start_date": "Enero de 2025",
    "end_date": "En desarrollo",
    "challenges": "Confección de un sitio web desarrollado en Next JS, que consume contenido de un CMS Headless. Diseño de las entidades y esquemas de contenido para el CMS, así como la integración del mismo con el frontend.",
    "long_role_explanation": "Me encargo del desarrollo del sitio, armando la estructura del mismo, organizando las páginas y componentes, así como la integración con el CMS Headless y servicios de terceros como Google Analytics y Google Tag Manager. También me encargo de la creación de los esquemas y tipados del contenido que se carga en el CMS asi como del mantenimiento y desarrollo de la interfaz desde donde se crea y publica el contenido.",
    "technologies": ["React", "Next.js", "Typescript", "Sanity", "MaterialUI"],
    "slug": "sinapsis-site"
  },
  {
    "id": "9",
    "title": "SRF Convocation",
    "description": "Self-Realization Fellowship es una organización espiritual fundada por Paramahansa Yogananda con el propósito de difundir las enseñanzas del Kriya Yoga y promover la realización personal y la comunión directa con Dios.",
    "full_description": "SRF ayuda y guía a las personas en el camino hacia una vida equilibrada, interiormente plena y espiritualmente consciente, integrando los principios del yoga con valores universales presentes en las principales religiones a través de sus lecciones, actividades, libros y centros de meditación alrededor del mundo. Convocation portal es un sitio web desarrollado para la organización, donde los usuarios pueden registrarse para participar del evento anual principal, el cual incluye multiples actividades organizadas para los cuales los usuarios deben gestionar su asistencia individualmente así como seleccionar add-ons, horarios, etc. El contenido del sitio proviene de un headless CMS (Contentful) e incluye un sistema de gestión de usuarios complejo con autenticación SSO, sistema de pagos, gestión de eventos y calendarios. En paralelo se desarrolló una aplicación mobile para escanear QR codes y gestionar la asistencia de los usuarios a los eventos.",
    "images": [
      {
        "url": "/images/srf-convocation/srf-convocation-1.png",
        "alt": "SRF Convocation image 1"
      },
      {
        "url": "/images/srf-convocation/srf-convocation-2.png",
        "alt": "SRF Convocation image 2"
      }
    ],

    "start_date": "Noviembre de 2023",
    "end_date": "Mayo de 2024",
    "challenges": "Confección de componentes reutilizables que consuman contenido de Contentful, un CMS Headless. Integración de un sistema de autenticación SSO que detecte si el usuario ya está logueado en algun otro sitio de la organización. Integración de Google Calendar para la gestión de eventos. Integración de un sistema de pagos propio. Creación de una herramienta para escanear QR codes y gestionar la asistencia de los usuarios a los eventos, conectado a un backend compartido con el sitio web.",
    "long_role_explanation": "Fui parte de un equipo de desarrollo encargado de multiples tareas dentro del proyecto. Me encargué de la creación de componentes reutilizables que consumen contenido de Contentful soportando multilenguaje y que ademas interactuan con el backend. También trabajé en la integración de Google Calendar para la gestión de eventos, multiples herramientas de soporte para el desarrollo como lo son los bug trackers. Por otro lado también trabaje en la integración de un sistema de pagos y de una aplicación mobile para escanear QR codes bajo la herramienta low code Retool. Para mostrar el contenido en el sitio web tuvimos que generarlo en el CMS y luego consumirlo desde el frontend, lo que requirió una buena comunicación con el equipo de backend para definir los esquemas de las entidades y que éstos sean consistentes.",
    "technologies": [
      "React",
      "Next.js",
      "Typescript",
      "Contentful",
      "TailwindCSS",
      "Retool",
      "Vercel",
      "Gitlab"
    ],
    "slug": "srf-convocation"
  },
  {
    "id": "10",
    "title": "SRF Youth Services",
    "description": "Self-Realization Fellowship es una organización espiritual fundada por Paramahansa Yogananda con el propósito de difundir las enseñanzas del Kriya Yoga y promover la realización personal y la comunión directa con Dios.",
    "full_description": "SRF ayuda y guía a las personas en el camino hacia una vida equilibrada, interiormente plena y espiritualmente consciente, integrando los principios del yoga con valores universales presentes en las principales religiones a través de sus lecciones, actividades, libros y centros de meditación alrededor del mundo. Youth Services es un sitio web desarrollado para la organización, donde los usuarios de la plataforma principal pueden registrar a niños y adolescentes para participar de actividades y programas brindados por la organización. El contenido del sitio proviene de un headless CMS (Contentful) e incluye un sistema de gestión de usuarios complejo con autenticación SSO, sistema de pagos, gestión de eventos e integración a un servicio de terceros para firma de documentos de consentimiento.",
    "images": [
      {
        "url": "/images/srf-youth-services/srf-youth-services-1.png",
        "alt": "SRF Youth Services image 1"
      },
      {
        "url": "/images/srf-youth-services/srf-youth-services-2.png",
        "alt": "SRF Youth Services image 2"
      }
    ],
    "start_date": "Marzo de 2024",
    "end_date": "Julio de 2024",
    "challenges": "Creación de un formulario de registro multistep con validaciones y gestión de errores para cada uno de los pasos. Integración de un sistema de autenticación SSO que detecte si el usuario ya está logueado en algun otro sitio de la organización. Integración de un sistema de pagos propio. Integración a un servicio de terceros para firma de documentos de consentimiento. Comunicación constante con el equipo de backend y un equipo tercerizado encargado de la gestion de los registrios via Microsoft Dynamics. Creación de contenido y posterior consumo del mismo desde Contentful.",
    "long_role_explanation": "En este proyecto fui único desarrollador frontend, donde me encargué de la creación de un formulario de registro siguiendo las buenas prácticas y recomendaciones de la organización SRF aplicadas en su sitio web principal. El formulario es multistep y cuenta con validaciones y gestión de errores para cada uno de los campos en cada uno de los pasos. Además, se integró un sistema de autenticación SSO que detecta si el usuario ya está logueado en algún otro sitio de la organización. También se implementó un sistema de pagos propio y se integró a un servicio de terceros para la firma de documentos de consentimiento. La comunicación constante con el equipo de backend y un equipo tercerizado encargado de la gestión de los registros via Microsoft Dynamics fue fundamental para el éxito del proyecto. Por último, se creó contenido en Contentful y se consumió desde el frontend soportando multilenguaje.",
    "technologies": [
      "React",
      "Next.js",
      "Typescript",
      "Contentful",
      "TailwindCSS",
      "Vercel",
      "Gitlab",
      "Microsoft Dynamics",
      "PandaDoc"
    ],
    "slug": "srf-youth-services"
  },
  {
    "id": "11",
    "title": "Regitech POS (Point of Sale)",
    "description": "Regitech es un comercio minorista de venta de productos y accesorios tecnológicos, con el plus de ofrecer servicios de reparación con tecnología de punta.",
    "full_description": "Regitech es un emprendimiento propio que combina la venta de productos y accesorios tecnológicos con servicios de reparación de diversos dispositivos. La tienda se destaca por su enfoque en la calidad a la hora de ofrecer sus servicios al cliente y por su atención personalizada. Regitech POS surgió como una necesidad de gestionar las ventas, clientes, inventario y servicios de reparación de manera eficiente luego del crecimiento sostenido del negocio a lo largo del tiempo. La plataforma permite gestionar el inventario de productos, sus clientes, proveedores, organizar las ordenes de reparación y ventas, así como generar reportes y estadísticas sobre el desempeño del negocio todo de manera online y en tiempo real.",
    "images": [
      {
        "url": "/images/regitech/regitech-1.png",
        "alt": "Regitech image 1"
      },
      {
        "url": "/images/regitech/regitech-2.png",
        "alt": "Regitech image 2"
      },
      {
        "url": "/images/regitech/regitech-3.png",
        "alt": "Regitech image 3"
      }
    ],
    "start_date": "Abril de 2025",
    "end_date": "En desarrollo",
    "challenges": "Confección de un sistema de gestión de usuarios y autenticación con roles. Confección de un sistema de gestión de inventario, ventas, proveedores y ordenes de reparación. Generación de reportes y estadísticas sobre el desempeño del negocio. Desarrollo de una base de datos solida y escalable para soportar el crecimiento del negocio a lo largo del tiempo.",
    "long_role_explanation": "Siendo este un proyecto personal, me encargo del desarrollo de la totalidad de la plataforma. Desde la creación de la base de datos con sus esquemas de entidades, el backend, el frontend, la maquetación e integración de los diferentes componentes, el host y los despliegues. Trabajo a la par de un diseñador gráfico que se encarga de la creación del diseño del sitio a partir de la identidad visual del negocio, asi como tambien trabajo consultando con el equipo de ventas del comercio para entender sus necesidades e ir ajustando el producto a medida que avanza el desarrollo.",
    "technologies": [
      "React",
      "ShadCn",
      "Typescript",
      "Next.js",
      "Supabase",
      "TailwindCSS",
      "Vercel"
    ],
    "slug": "regitech"
  },
  {
    "id": "12",
    "title": "Otras tareas",
    "description": "Ademas de los proyectos mencionados, a lo largo de mi carrera he trabajado en otros aspectos a medida que mi conocimiento, experiencia y habilidades fueron creciendo.",
    "full_description": "A lo largo de mi carrera como desarrollador frontend, he tenido la oportunidad de trabajar en una variedad de proyectos y tareas que han contribuido a mi crecimiento profesional. Desde mis inicios, siempre he buscado aprender, entender el funcionamiento de las cosas y mejorar sus procesos para optimizar el tiempo, los recursos y el rendimiento. He trabajado en la creación de herramientas internas para mejorar la eficiencia del equipo, así como en la implementación de buenas prácticas de desarrollo, en la creación de documentación técnica y en brindar apoyo en proyectos externos ante dificultades tecnicas. También he participado en la creación de librerías de componentes reutilizables y en la creación de templates sobre los que montar nuevos proyectos. Como parte de mi desarrollo profesional, me ha tocado en multiples ocasiones hacer investigaciones de campo sobre posibles mejoras en el flujo de trabajo y sobre la modernización del stack de tecnologías utilizado por el equipo, así como la posterior enseñanza y capacitación a parte del equipo. En algunas situaciones me ha tocado trabajar en proyectos que ya contaban con un equipo de desarrollo, en esos escenarios tuve que adaptarme a equipos ya consolidados, a su forma de trabajo y a su stack de tecnologías, en esos casos he aprendido a adaptarme pero tambien a proponer puntos de mejora llevando mis experiencias previas a la mesa.",
    "images": [
      {
        "url": "/images/other/other-1.jpg",
        "alt": "Other image 1"
      },
      {
        "url": "/images/other/other-2.webp",
        "alt": "Other image 2"
      },
      {
        "url": "/images/other/other-3.png",
        "alt": "Other image 3"
      }
    ],
    "start_date": "",
    "end_date": "",
    "challenges": "",
    "long_role_explanation": "",
    "technologies": [
      "Soft skills",
      "Teamwork",
      "Problem solving",
      "Research",
      "Teaching",
      "Learning"
    ],
    "slug": "other"
  }
]
